{
  "Mobs search radius (in blocks)": 120,
  "Block search radius (in blocks). Large values may result in lag issues": 60,
  "Containers search radius (in blocks). Large values may result in lag issues": 60,
  "Will experience be drained for using the compass?": false,
  "How often the compass search target will be updated. Low values can cause SERIOUS performance problems.": 50,
  "How much XP will be drained from player when Compass is active?": 2,
  "How often experience will be spent for using the compass?": 2,
  "Allows players to search for mobs based on their Spawn Eggs.": true,
  "Allows players to search for containers (chests, furnaces, etc.) based on their contents.": true,
  "Allows players to search for blocks.": true,
  "Allows players to search for Villagers based on their trade items.": true,
  "Allows players to search for mobs based on their drop.": true,
  "Allows players to search for items lying on the ground.": true,
  "Allows players to search for fluids based on their buckets.": true,
  "Allows players to search for spawners.": true,
  "Allows players to search for entities based on their inventories.": true,
  "Setting the value to true will make the compass search for all objects except those specified in the list.\nSetting it to false will make the compass search only for objects listed in the list.": true,
  "Items and blocks in this list will be filtered based on the filtering mode set above.\nExample: [\"minecraft.diamond_block\", \"minecraft.carrot\", \"twilightforest.cicada\"]": [],
  "Items and blocks in this list will be filtered based on their tags.\nExample: [\"forge:stone\"]": [],
  "Anything related to the mods in the list below will (not) be searched by compass.\nExample: [\"alexscaves\", \"ae2\", \"minecraft\"]": [],
  "Entities in this list will be filtered based on what mod they are from.\nExample: [\"creeperoverhaul\", \"deeperdarker\", \"minecraft\"]": [],
  "All items and blocks will (not) be searched if the mod they belong to is in the list below": [],
  "Entities in this list will be filtered based on their names.\nExample: [\"entity.minecraft.trader_llama\", \"entity.mowziesmobs.foliaath\"]": [],
  "Enable interaction with the REI panel": true,
  "Enable interaction with the JEI panel": true,
  "Enable the search for the contents of chests and minecarts from the Lootr mod that have not yet been opened by the player": true,
  "Allows to show TOP tooltips regarding blocks/entities that you can/can\u0027t search for": true,
  "Allows to show Jade tooltips regarding blocks/entities that you can/can\u0027t search for": true,
  "Prevents players from searching items lying on the ground. Default Value - false": false
}